Reports/ОтчетДляПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>ОтчетДляПланировщика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:TaskRef.Мероприятие</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ЗадолженностьПоОбъектам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьПоОбъектам</Name>
			<Comment>Трейд Софт Задолженность по долговому обязательству</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДО</Name>
					<Comment>Сумма задолженности в валюте долгового обязательства</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Comment>Сумма задолженности в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДолгРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрафыРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПениРегл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая1Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая2Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая3Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая4Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая5Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая6Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая7Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8ДО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Составляющая8Регл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Comment>Дополнительная аналитика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Должник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредитор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретАвтообзвона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеконтактныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетДляПланировщика/Ext/ObjectModule.bsl
Процедура ЗаполнитьТабличныйДокумент(ТабДок) Экспорт
	Макет = ЭтотОбъект.ПолучитьМакет("МакетДолг");
	ТабДок.Очистить();	
	
	Если ТипЗнч(Объект) = Тип("ЗадачаСсылка.Мероприятие") Тогда
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Мероприятие = Объект;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Область = Макет.ПолучитьОбласть("ШапкаДолг");
		
		Если Константы.УчетПоДО.Получить() = Истина Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ДолговыеОбязательстваКонтрагенты.Ссылка КАК ДО,
			                      |	ДолговыеОбязательстваКонтрагенты.Значение КАК Должник
			                      |ПОМЕСТИТЬ Табл_ДО
			                      |ИЗ
			                      |	Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
			                      |ГДЕ
			                      |	ДолговыеОбязательстваКонтрагенты.Значение = &Объект
			                      |	И ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = &ВидКонтрагента
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРеглОстаток
			                      |ИЗ
			                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(
			                      |			&Период,
			                      |			Объект В
			                      |				(ВЫБРАТЬ
			                      |					ааа.ДО
			                      |				ИЗ
			                      |					Табл_ДО КАК ааа)) КАК ЗадолженностьПоОбъектамОстатки");
			Запрос.УстановитьПараметр("ВидКонтрагента", Перечисления.ВидыКонтрагентов.Должник);
		Иначе
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток КАК ОсновнойДолгРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток КАК ПроцентыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток КАК ШтрафыРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток,
			                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток КАК СуммаРеглОстаток
			                      |ИЗ
			                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&Период, Объект = &Объект) КАК ЗадолженностьПоОбъектамОстатки");							  
		КонецЕсли;
		Запрос.УстановитьПараметр("Объект", Объект);        
		
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		Результат = Запрос.Выполнить().Выбрать();
				
		Область.Параметры.ОсновнойДолг = "0";		
		Область.Параметры.Проценты = "0";
		Область.Параметры.Штрафы = "0";
		Область.Параметры.Пени = "0";
		Область.Параметры.Составляющая1 = "0";
		Область.Параметры.Составляющая2 = "0";
		Область.Параметры.Составляющая3 = "0";
		Область.Параметры.Составляющая4 = "0";
		Область.Параметры.Составляющая5 = "0";
		Область.Параметры.Составляющая6 = "0";
		Область.Параметры.Составляющая7 = "0";
		Область.Параметры.Составляющая8 = "0";
		Область.Параметры.Итого = "0";
		
		Если Результат.Следующий() Тогда
			Область.Параметры.ОсновнойДолг = Формат(Результат.ОсновнойДолгРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Проценты = Формат(Результат.ПроцентыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Штрафы = Формат(Результат.ШтрафыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Пени = Формат(Результат.ПениРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая1 = Формат(Результат.Составляющая1РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая2 = Формат(Результат.Составляющая2РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая3 = Формат(Результат.Составляющая3РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая4 = Формат(Результат.Составляющая4РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая5 = Формат(Результат.Составляющая5РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая6 = Формат(Результат.Составляющая6РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая7 = Формат(Результат.Составляющая7РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая8 = Формат(Результат.Составляющая8РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Итого = Формат(Результат.СуммаРеглОстаток, "ЧДЦ=2; ЧН=0");		
			Область.Параметры.Валюта = Константы.ВалютаРегламентированногоУчета.Получить().НаименованиеПолное;
		КонецЕсли;
	Иначе	
		Область = Макет.ПолучитьОбласть("ШапкаДолг");
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗадолженностьПоОбъектамОстатки.ОсновнойДолгРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.ПроцентыРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.ШтрафыРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.ПениРеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая1РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая2РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая3РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая4РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая5РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая6РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая7РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.Составляющая8РеглОстаток,
		                      |	ЗадолженностьПоОбъектамОстатки.СуммаРеглОстаток
		                      |ИЗ
		                      |	РегистрНакопления.ЗадолженностьПоОбъектам.Остатки(&Период, Объект = &Объект) КАК ЗадолженностьПоОбъектамОстатки");
		Запрос.УстановитьПараметр("Объект", Объект);                         
		Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
		Результат = Запрос.Выполнить().Выбрать();
		
		Область.Параметры.ОсновнойДолг = "0";
		Область.Параметры.Проценты = "0";
		Область.Параметры.Штрафы = "0";
		Область.Параметры.Пени = "0";
		Область.Параметры.Составляющая1 = "0";
		Область.Параметры.Составляющая2 = "0";
		Область.Параметры.Составляющая3 = "0";
		Область.Параметры.Составляющая4 = "0";
		Область.Параметры.Составляющая5 = "0";
		Область.Параметры.Составляющая6 = "0";
		Область.Параметры.Составляющая7 = "0";
		Область.Параметры.Составляющая8 = "0";
		Область.Параметры.Итого = "0";
	
		
		Если Результат.Следующий() Тогда
			Область.Параметры.ОсновнойДолг = Формат(Результат.ОсновнойДолгРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Проценты = Формат(Результат.ПроцентыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Штрафы = Формат(Результат.ШтрафыРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Пени = Формат(Результат.ПениРеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая1 = Формат(Результат.Составляющая1РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая2 = Формат(Результат.Составляющая2РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая3 = Формат(Результат.Составляющая3РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая4 = Формат(Результат.Составляющая4РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая5 = Формат(Результат.Составляющая5РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая6 = Формат(Результат.Составляющая6РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая7 = Формат(Результат.Составляющая7РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Составляющая8 = Формат(Результат.Составляющая8РеглОстаток, "ЧДЦ=2; ЧН=0");
			Область.Параметры.Итого = Формат(Результат.СуммаРеглОстаток, "ЧДЦ=2; ЧН=0");		
			Область.Параметры.Валюта = Константы.ВалютаРегламентированногоУчета.Получить().НаименованиеПолное;
		КонецЕсли;
	КонецЕсли;
	
	Область.Параметры.ОсновнойДолгИмя = ПланыВидовХарактеристик.ТипыЗадолженности.ОсновнойДолг.Наименование;
	Область.Параметры.ПроцентыИмя = ПланыВидовХарактеристик.ТипыЗадолженности.Проценты.Наименование;
	Область.Параметры.ШтрафыИмя = ПланыВидовХарактеристик.ТипыЗадолженности.Штрафы.Наименование;
	Область.Параметры.ПениИмя = ПланыВидовХарактеристик.ТипыЗадолженности.Пени.Наименование;
	Область.Параметры.Составляющая1Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая1.Наименование;
	Область.Параметры.Составляющая2Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая2.Наименование;
	Область.Параметры.Составляющая3Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая3.Наименование;
	Область.Параметры.Составляющая4Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая4.Наименование;
	Область.Параметры.Составляющая5Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая5.Наименование;
	Область.Параметры.Составляющая6Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая6.Наименование;
	Область.Параметры.Составляющая7Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая7.Наименование;
	Область.Параметры.Составляющая8Имя = ПланыВидовХарактеристик.ТипыЗадолженности.Составляющая8.Наименование;	
	
	ТабДок.Вывести(Область);
КонецПроцедуры
